/****************************************************************************************
 * 010 – Функции в языке JavaScript
 * --------------------------------------------------------------------------------------
 *  PhpStorm 2023.1
 *  HTML, CSS, JavaScript
 * --------------------------------------------------------------------------------------
 * Уроки JavaScript для начинающих с нуля!
 * Gosha Dudar (2020)
 * https://www.youtube.com/watch?v=fHl7UyRjOf0&list=PLDyJYA6aTY1kJIwbYHzGOuvSMNTfqksmk
 *
 ****************************************************************************************
 * Writing by sgiman @ 2023
 */
// Локальная переменная опеределённая внутри фукции - видна только внутри функции
// Глобальнная переменная определённая вне функции  - видна везде
console.log(glob)       // var (устарел)
console.log(glob_1)     // let
console.log(glob_2)

var num = 10;       // глобальная

function info () {
    var num = 20;   // локальная
    console.log("Local: " + num)
}

info()

console.log("Global: " + num)
