/****************************************************************************************
 * 003 – Вывод информации. Работа с консолью
 * --------------------------------------------------------------------------------------
 *  PhpStorm 2023.1
 *  HTML, CSS, JavaScript
 * --------------------------------------------------------------------------------------
 * Уроки JavaScript для начинающих с нуля!
 * Gosha Dudar (2020)
 * https://www.youtube.com/watch?v=fHl7UyRjOf0&list=PLDyJYA6aTY1kJIwbYHzGOuvSMNTfqksmk
 *
 ****************************************************************************************
 * Writing by sgiman @ 2023
 */
console.log("Сообщение: \"log\"")
console.info("Сообщение: \"info\"")
console.error("Сообщение: \"Ошибка\"")
console.warn("Сообщение: \"Уведомление!\"")
